---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.Directcontext3dServerId
source: html/1c761235-9db6-9a1d-7fd3-0f308ec5cb88.htm
---
# Autodesk.Revit.DB.ParameterTypeId.Directcontext3dServerId Property

"ServerId"

## Syntax (C#)
```csharp
public static ForgeTypeId Directcontext3dServerId { get; }
```